app/views/partials/_capsule.html.erb

<% offer_token = (session[:_csrf_token] ||= SecureRandom.base64(32)) %>
<% @last_offer = product.offers.last(:conditions => ["ip = ? and token = ?", request.remote_ip, offer_token]) %>
---
SELECT `offers`.* FROM `offers` WHERE `offers`.`product_id` = 3 AND (ip = '127.0.0.1' and token ='o8V1yOYjpvgamDeiXxA0VI5/1dPLtli5eC4d8NTwLAU=' and response = 'counter') ORDER BY `offers`.`id` DESC LIMIT 1