app/controllers/home_controller.rb

  def index
    if params[:signed_request]
      begin
        signed_request = parse_signed_request(params, oauth_secret("facebook"))
        if signed_request["user_id"]
          session[:signed_request] = params[:signed_request]
        else
          redirect_to :action => "callback"
        end
      rescue => e
        # render :text => e.message.inspect and return false
        redirect_to :action => "callback" and return
      end
    else
      flash.discard
      if logged_in?
        if current_user.profile.nil?
          render :template => "users/profile"
        elsif current_user.products.empty?
---
SELECT COUNT(*) FROM `products` WHERE `products`.`user_id` = 1
SELECT `products`.* FROM `products` WHERE `products`.`user_id` = 1 ORDER BY `products`.`id` DESC LIMIT 1
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1

  def notifications
    @notifications = [["profile", current_user.profile.created_at], ["products", current_user.products.last.created_at]]
    @last_action_on = @notifications.sort{|n1, n2| n2[1] <=> n1[1]}.first[1]
---
SELECT `products`.* FROM `products` WHERE `products`.`user_id` = 1 ORDER BY `products`.`id` DESC LIMIT 1
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1

  def analytics
    @today = Date.today-1.day
    if request.post?
      @page = params[:page].to_i
    else
      @page = 1
    end
    @size = 5
    @per_page = 1
    @post_pages = (@size.to_f/@per_page).ceil;
    @page =1 if @page.to_i<=0 or @page.to_i > @post_pages
    @titleX = "Time Period"
    @titleY = "#"
    @colors = ["blue"]
    @i = 0
    @head_line = ""

    case @page
      when @i+=1
        @head_line = "Look at your cool analytics!"
        @title = "# Of Visits"
        @offers_a = Offer.first(:select => "SUM(counter) as total", :joins => "INNER JOIN products ON offers.product_id=products.id and products.user_id = #{current_user.id} and response NOT LIKE 'expired'")
---
SELECT SUM(products.regular_price-price) as total FROM `offers` INNER JOIN products ON offers.product_id=products.id and products.user_id = 1 and response LIKE 'paid' and Date(offers.updated_at) = '2012-07-11' LIMIT 1
SELECT `offers`.* FROM `offers` WHERE (response like 'paid')

        @title = "Dollars Total Discount"
        @titleY = "$"

        @offers_a = Payment.first(:select => "SUM((products.regular_price*payments.quantity)-offers.price) as total", :joins => "INNER join offers on (payments.offer_id=offers.id) INNER join products on (offers.product_id = products.id) and products.user_id = #{current_user.id} and offers.response LIKE 'paid'")
---
SELECT SUM((products.regular_price*payments.quantity)-offers.price) as total FROM `payments` INNER join offers on (payments.offer_id=offers.id) INNER join products on (offers.product_id = products.id) and products.user_id = 1 and response LIKE 'paid' and Date(offers.updated_at) = '2012-07-11' LIMIT 1

  def say_your_price
    if logged_in?
      redirect_to root_path
      return
    end
    if request.post?
      @page = params[:page].to_i
    else
      @page = 1
    end
    @type = params[:type]
    @size = (@type ? Product.by_product_type(@type).count.to_i : Product.count.to_i)
---
SELECT COUNT(*) FROM `products` WHERE (product_type = '1')
SELECT `products`.* FROM `products` WHERE (product_type = '1') LIMIT 0,1

  def winners
    @payments = Payment.all(:order => "id desc", :joins => "INNER JOIN offers ON payments.offer_id=offers.id", :limit => 100)
---
SELECT `payments`.* FROM `payments` INNER JOIN offers ON payments.offer_id=offers.id ORDER BY id desc LIMIT 100

  def ticket_book
    @products = []
    if params[:name]
      @ticket = params[:name]
      return
    end
    if request.post?
        offer_token = (session[:_csrf_token] ||= SecureRandom.base64(32))
        reset_session
        session[:no_of_tickets] = params[:no_of_tickets]
        @products = Product.find_all_by_name(params[:ticket])

        @size = @products.size
        @per_page = 1
        @post_pages = (@size.to_f/@per_page).ceil;

        @page = params[:page].to_i
        @page = 1 if @page < 1
        @products = Product.where(["name = ?",params[:ticket]]).limit("#{@per_page*(@page - 1)}, #{@per_page}")
        @page_start_num = ((@page - 4) > 0) ? (@page - 4) : 1
        @page_end_num = ((@page_start_num + 8) > @post_pages) ? @post_pages : (@page_start_num + 8)
        @page_start_num = ((@post_pages - @page_end_num) < 8) ? (@page_end_num - 8) : @page_start_num
        @page_start_num = 1 if @page_start_num < 1

        Offer.update_all("response = 'expired'", ["ip = ? and token = ? and (response IS NULL OR response NOT IN (?))", request.remote_ip, offer_token, ["paid", "rejected"]])
---
SELECT `products`.* FROM `products` WHERE `products`.`name` = 'Premium Peak Ticket'
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM `products` WHERE (name = 'Premium Peak Ticket') LIMIT 0,1) subquery_for_count
SELECT `products`.* FROM `products` WHERE (product_type = 1)
UPDATE `offers` SET response = 'expired' WHERE (ip = '127.0.0.1' and token = 'aWCWvggpWlFXQAGX30APys3DvKU622aY7K+SqvtoSUg=' and (response IS NULL OR response NOT IN ('paid','rejected')))