app/controllers/products_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`id` = 10 LIMIT 1
---
  def edit
    @product = Product.find_by_id(params[:id])

SELECT `products`.* FROM `products` WHERE `products`.`id` = 10 LIMIT 1
UPDATE `products` SET `image_file_name` = 'P1276_Austin_RadioCity_405x270.jpg', `image_content_type` = 'image/jpeg', `image_file_size` = 21026, `image_updated_at` = '2012-07-10 07:24:19', `updated_at` = '2012-07-10 07:24:19' WHERE `products`.`id` = 10
---
  def update
    id = params[:id]
    redirect_to "/" and return if id.nil?
    @product = Product.find_by_id(id)
    redirect_to "/" and return if @product.nil?
    #if request.post?
      @product.attributes = params[:product]
      if @product.save

INSERT INTO `products` (`created_at`, `description`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `is_live`, `name`, `product_type`, `quantity`, `regular_price`, `target_price`, `updated_at`, `user_id`) VALUES ('2012-07-09 07:30:57', 'Premium Peak Ticket', 'image/jpeg', 'P1276_Austin_RadioCity_405x270.jpg', 21026, '2012-07-09 07:30:57', 1, 'Premium Peak Ticket', 1, NULL, 150.0, 128.0, '2012-07-09 07:30:57', 1)
---
  def create
    if request.post?
      @product = current_user.products.new(params[:product])
      if @product.valid? and @product.errors.empty?
        @product.quantity = params[:product][:quantity].gsub(/\D+/, "") if params[:product][:quantity]
        @product.regular_price = params[:product][:regular_price].gsub(/\D+/, "")
        @product.target_price = params[:product][:target_price].gsub(/\D+/, "")
        if @product.save

SELECT `payments`.* FROM `payments` WHERE `payments`.`id` = 1 LIMIT 1
SELECT `offers`.* FROM `offers` WHERE `offers`.`id` = 10 LIMIT 1
---
  def payments
    if request.post?
      if params[:email]
        @payment = Payment.find(params[:id])
        @email = params[:email]
        if check_emails(@email)
          NotifyMailer.sendcoupon(@email, @payment).deliver
          flash[:notice] = "Thank you for playing! You will get your voucher soon!"
          redirect_to root_path
          return
        else
          flash[:error]= "Hi, please enter a valid email address"
          render :template => "/products/success"
          return
        end
      else
        @offer = Offer.find_by_id(params[:id].to_i)

SELECT `payments`.* FROM `payments` WHERE `payments`.`offer_id` = 38 LIMIT 1
INSERT INTO `payments` (`cc_expiry_m`, `cc_expiry_y`, `cc_number`, `cc_type`, `city`, `country`, `created_at`, `email`, `first_name`, `last_name`, `offer_id`, `phone`, `postal_code`, `price`, `quantity`, `state`, `street1`, `street2`, `transaction_id`, `updated_at`) VALUES (7, 2017, 5462828274362385, 'master', 'Mountain View,', 'USA', '2012-07-09 11:32:39', 'brijeshshah86@gmail.com', 'Dealkat', 'Shah', 38, 4153233506, '9401', 231.0, NULL, 'CA', '82 Pioneer Way', NULL, '3S287197JD956641M', '2012-07-09 11:32:39')
---
            success,msg = @payment.purchase(@payment.price)
            if success
              @payment.cc_number = @payment.cc_number + 42891
              payment_found = Payment.find_by_offer_id(@offer.id)
              if payment_found
                @payment = payment_found
              else
                @payment.save

UPDATE `offers` SET `response` = 'paid', `updated_at` = '2012-07-09 11:32:39' WHERE `offers`.`id` = 38
---
                end
                # NotifyMailer.payment_mail_to_merchant(recipients, @payment).deliver
                # NotifyMailer.payment_mail_to_consumer(admins, @payment).deliver
                @payment.offer.update_attribute(:response, "paid")

SELECT `payments`.* FROM `payments` WHERE `payments`.`id` = 1 LIMIT 1
---
  def download_pdf
    if params[:id]
      @payment = Payment.find_by_id(params[:id])

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
SELECT `offers`.* FROM `offers` WHERE `offers`.`product_id` = 3 AND (ip = '127.0.0.1' and token ='o8V1yOYjpvgamDeiXxA0VI5/1dPLtli5eC4d8NTwLAU=' and response = 'counter') ORDER BY `offers`.`id` DESC LIMIT 1
UPDATE `offers` SET response='expired' WHERE `offers`.`product_id` = 1 AND (ip = '127.0.0.1' and token = 'o8V1yOYjpvgamDeiXxA0VI5/1dPLtli5eC4d8NTwLAU=' and id <= 10 and (response IS NULL OR response LIKE 'counter'))
SELECT `offers`.* FROM `offers` WHERE `offers`.`product_id` = 3 AND (ip = '127.0.0.1' and token = 'o8V1yOYjpvgamDeiXxA0VI5/1dPLtli5eC4d8NTwLAU=' and id <= 11 and (response IS NULL OR response LIKE 'counter'))
---
  def show
    if params[:id]
      @product = Product.find_by_id(params[:id])
      if @product.nil?
        redirect_to root_path
        return
      end
      offer_token = (session[:_csrf_token] ||= SecureRandom.base64(32))

      @last_offer = @product.offers.last(:conditions => ["ip = ? and token = ?", request.remote_ip, offer_token])
      if request.post?
        if @last_offer and @last_offer.accepted?
          return
        end
        if params[:submit_button]
          submit = params[:submit_button].strip.downcase
          if ["yes", "no"].include? submit
            if submit == "no"
              @last_offer.update_attribute(:response, "rejected")
              flash[:error] = "Sorry we can't make a deal right now. Try again later?"
            elsif submit == "yes"
              @last_offer.update_attribute(:response, "accepted")
              flash[:notice] = (@last_offer.price == 0) ? "Cool! Congrats! you won free Dealkat khakis. Share with facebook /twitter friends!" : "Cool come on down to the show!"
            end
            for offer in @product.offers.all(:conditions => ["ip = ? and token = ? and id < ? and (response IS NULL OR response LIKE 'counter')", request.remote_ip, offer_token, @last_offer.id])

INSERT INTO `offers` (`counter`, `created_at`, `ip`, `price`, `product_id`, `response`, `token`, `updated_at`) VALUES (1, '2012-07-09 07:41:13', '127.0.0.1', 60.0, 1, NULL, 'o8V1yOYjpvgamDeiXxA0VI5/1dPLtli5eC4d8NTwLAU=', '2012-07-09 07:41:13')
---
              end
          else
              @offer = Offer.new(:ip => request.remote_ip, :token => offer_token, :product_id => @product.id, :price => price, :counter => 1)
              @offer.save