app/controllers/users_controller.rb

  def biz
    if logged_in?
      redirect_to root_path
      return
    end
    if params[:user]
      logout_keeping_session!
      @user = User.authenticate(params[:user][:email], params[:user][:password])
      if @user
        session[@user.email] = nil

        self.current_user = @user
        # new_cookie_flag = (params[:remember_me] == "1")
        # handle_remember_cookie! new_cookie_flag
        redirect_back_or_default('/')
        flash[:notice] = nil
      else
        @new_user = User.find_by_email(params[:user][:email])
        if @new_user
          flash[:error] = "Please enter valid information"
        else
          @user = User.new(params[:user])
          if @user.email.blank? || @user.password.blank? || !check_emails(params[:user][:email])
            flash.now[:error] = "Wrong Username/Email and password combination."
          end

          success = @user && @user.valid?
          if success && @user.errors.empty?
            @user.save
---
SELECT `users`.* FROM `users` WHERE (email = 'biz@dealkat.com' and password='princessthecat') LIMIT 1
INSERT INTO `users` (`created_at`, `email`, `password`, `remember_token`, `remember_token_expires_at`, `updated_at`) VALUES ('2012-07-09 07:04:51', 'biz@dealkat.com', 'princessthecat', NULL, NULL, '2012-07-09 07:04:51')

  def profile
    @profile = current_user.profile if current_user.profile
    if request.post?
      @profile = (current_user.profile || Profile.new(params[:profile]))
      @profile.attributes = params[:profile]
      if @profile.errors.empty? and @profile.valid?
        # header color: 415F9B
        @profile.user = current_user
        @profile.save
---
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1
INSERT INTO `profiles` (`address`, `created_at`, `email`, `facebook_url`, `header_color`, `logo_content_type`, `logo_file_name`, `logo_file_size`, `logo_updated_at`, `name`, `phone`, `twitter`, `updated_at`, `user_id`, `website`) VALUES ('82 Pioneer Way', '2012-07-09 07:06:38', 'p.reservations@perrysouthbeachhotel.com', 'http://facebook.com/dealkat', '1919FF', 'image/jpeg', 'mylogo.jpg', 1056, '2012-07-09 07:06:38', 'Dealkat', 4153233506, 'dealkat', '2012-07-09 07:06:38', 1, 'dealkat.com')