app/views/products/new.html.erb

<%= render :partial => "/partials/my_dashboard" if current_user.products.count > 0 %>
---
SELECT COUNT(*) FROM `products` WHERE `products`.`user_id` = 1