app/views/products/show.html.erb

SELECT `offers`.* FROM `offers` WHERE `offers`.`product_id` = 1 AND (ip = '127.0.0.1' and token = 'vG4XgQ0uh+vEp8H0Rs+LwIHbu4SS95vOpB+m8Ujyf5M=') ORDER BY `offers`.`id` DESC LIMIT 1
---
<% offer_token = (session[:_csrf_token] ||= SecureRandom.base64(32)) %>
<% @last_offer = @product.offers.last(:conditions => ["ip = ? and token = ?", request.remote_ip, offer_token]) %>